Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: As in the previous example, the final case matches all possible remaining values, and so a default case is not needed to make the switch statement exhaustive.
ja: 前の例の場合のように、最後のケース節は全てのあり得る残りの値に適合します、そしてdefaultケース節はこのswitch文を網羅的なものにするのに必要ではありません。

source: As in this example, careful choice of Boolean constant and variable names can help to keep code readable and concise, while avoiding double negatives or confusing logic statements.
ja: この例の場合のように、ブールの定数と変数の名前の慎重な選択はコードを読みやすく簡潔にしておくのを助けることができます、その一方で、二重の否定や、混乱させる論理文を避けてください。

source: As its name suggests, the toggle() method is intended to toggle or invert the state of any conforming type, typically by modifying a property of that type.
ja: その名前が暗示するように、toggle()メソッドはあらゆる準拠型の状態を切り換えるか逆にすることを意図します、概してその型のプロパティの修正によって。

source: As mentioned above, different characters can require different amounts of memory to store, so in order to determine which Character is at a particular position, you must iterate over each Unicode scalar from the start or end of that String.
ja: 上で述べたように、異なる文字は格納するのに異なるメモリ量を必要とすることがあり得ます、それでCharacterがある特定の位置にあることを確定するために、あなたはそのStringの始まりまたは終わりからユニコードスカラーそれぞれにわたってずっと繰り返さなければなりません。

source: As mentioned above, subclasses do not inherit their superclass initializers by default.
ja: 上で述べたように、サブクラスは何もしなければそれらのスーパークラスのイニシャライザを継承しません。

source: As mentioned above, substrings aren’t suitable for long-term storage—because they reuse the storage of the original string, the entire original string must be kept in memory as long as any of its substrings are being used.
ja: 上で言及したように、下位文字列は長期保管に適していません — それらがオリジナルの文字列のストレージを再利用することから、オリジナルの文字列全体はそれの下位文字列が使われている限りメモリに保持されなければなりません。

source: As mentioned above, the Rank enumeration defines a further nested structure of its own, called Values.
ja: 上で言及されるように、Rank列挙は独自の更なる入れ子にされた構造体を定義します、それはValuesと呼ばれます。

source: As mentioned above, the memory for an object is only considered fully initialized once the initial state of all of its stored properties is known.
ja: 上で言及したように、いったんその格納プロパティの全ての最初の状態が知られる場合にのみ、あるオブジェクトに対するメモリが充分に初期化されたとみなされます。

source: As mentioned in Generic Parameter Clause, you don’t use a generic argument clause to specify the type arguments of a generic function or initializer.
ja: 総称体パラメータ節で言及されるように、あなたは、総称体の関数やイニシャライザの型引数を指定するために総称体引数節を使いません。

source: As shown in the figure below, both number and stepSize refer to the same location in memory.
ja: 下の図で示すように、numberとstepSizeの両方ともメモリ中の同じ位置を参照します。

source: As shown in the figure below, they access different locations in memory.
ja: 下の図で示すように、それらはメモリ中の異なる位置を参照します。

source: As soon as all properties of the superclass have an initial value, its memory is considered fully initialized, and phase 1 is complete.
ja: スーパークラスの全てのプロパティが初期値を持つとすぐに、そのメモリは完全に初期化されるとみなされます、そして第１段階は完了します。

source: As soon as the default case is matched, the break statement ends the switch statement’s execution, and code execution continues from the if let statement.
ja: defaultケース節が適合したならすぐに、break文がswitch文の実行を終えます、そしてコード実行はif let文から続きます。

source: As such, index does not have to be declared before it is used.
ja: このように、indexは、それが使われる前に宣言される必要はありません。

source: As such, the performance characteristics of a throw statement are comparable to those of a return statement.
ja: throw文のいろいろな性能特徴は、それ自体としては、return文のそれと同程度です。

source: As the above example shows, patterns in a case can also bind constants using the let keyword (they can also bind variables using the var keyword).
ja: 上の例で示されるように、あるケース節中のいくつかのパターンはまた、letキーワードを使って定数に束縛できます（それらはまたvarキーワードを使って変数に束縛もできます）。

source: As the return type of a method
ja: メソッドの戻り型として

source: As the return type of a read-only subscript
ja: 読出し専用添え字の戻り型として

source: As the type of a constant, variable, or property
ja: 定数、変数、またはプロパティの型として

source: As the type of a read-only computed property
ja: 読出し専用の計算プロパティの型として

source: As the type of items in an array, dictionary, or other container
ja: 配列、辞書、または他のコンテナ中の項目の型として

source: As their names suggest, the value of a stored variable or a stored variable property is stored in memory.
ja: それらの名前が示すように、格納変数または格納変数プロパティの値はメモリに格納されます。

source: As with Int and Double above, you don’t need to declare constants or variables as Bool if you set them to true or false as soon as you create them.
ja: 上のIntとDoubleと同様に、あなたがそれらを作成するやいなやtrueまたはfalseに設定するならば、あなたは定数または変数をBoolとして宣言する必要はありません。

source: As with all unsafe operations, you take on the responsibility for checking that code for safety.
ja: すべての安全でない操作と同様に、あなたはコードの安全について検査する責任を持つようになります。

source: As with an array, you find out the number of items in a Dictionary by checking its read-only count property:
ja: 配列と同様に、あなたはあるDictionaryの中の項目の数を、それの読み出し専用のcountプロパティを調べることによって突き止めます：

source: As with an overridden property, method or subscript, the presence of the override modifier prompts Swift to check that the superclass has a matching designated initializer to be overridden, and validates that the parameters for your overriding initializer have been specified as intended.
ja: オーバーライドされるプロパティ、メソッドや添え字を書く時と同様に、override修飾子の存在はスウィフトにスーパークラスが一致している、オーバーライドされる指定イニシャライザを持つのを確認すること、そしてあなたがオーバーライドするイニシャライザのパラメータが意図されるように指定されてしまっているのを検証することを促します。

source: As with any other type, you can leave it to Swift to infer the function type when you assign a function to a constant or variable:
ja: あらゆる他の型と同様に、あなたが関数を定数または変数に代入するとき、あなたはスウィフトに関数型を推論するように任せることができます：

source: As with arrays, you can create an empty Dictionary of a certain type by using initializer syntax:
ja: 配列と同様に、あなたは、特定の型の空のDictionaryを作成することが、イニシャライザ構文を使うことで行えます：

source: As with arrays, you don’t have to write the type of the dictionary if you’re initializing it with a dictionary literal whose keys and values have consistent types.
ja: 配列と同様に、キーと値が首尾一貫した型をもつ辞書リテラルでそれを初期化しているならば、あなたは辞書の型を書く必要はありません。

source: As with computed properties, subscript declarations support reading and writing the value of the accessed elements.
ja: 計算プロパティと同様に、添え字宣言はアクセスされた要素の値を読み書きすることをサポートします。

source: As with computed properties, you can choose not to specify the setter’s (newValue) parameter.
ja: 計算プロパティと同様に、あなたはセッターの(newValue)パラメータを指定しないほうを選ぶことができます。

source: As with constant declarations, if the variable name is a tuple pattern, the name of each item in the tuple is bound to the corresponding value in the initializer expression.
ja: 定数宣言と同様に、変数名がタプルパターンであるならば、タプルの中の各項目の名前はイニシャライザ式の対応する値に縛りつけられます。

source: As with function and method parameters, initialization parameters can have both a parameter name for use within the initializer’s body and an argument label for use when calling the initializer.
ja: 関数とメソッドのパラメータと同様に、初期化パラメータは、イニシャライザの本文内で使用するためのパラメータ名とイニシャライザを呼ぶ時に使用するための引数ラベルの両方を持つことができます。

source: As with function and method parameters, the types of an initializer’s parameters can’t be more private than the initializer’s own access level.
ja: 関数やメソッドパラメータと同様に、イニシャライザのパラメーターの型は、そのイニシャライザ自身のアクセス水準よりも非公開にすることはできません。

source: As with methods, properties, and subscripts, you need to mark overridden designated initializers with the override declaration modifier.
ja: メソッド、プロパティ、そして添え字と同様に、あなたはオーバーライドした指定イニシャライザをoverride宣言修飾子で印する必要があります。

source: As with optionals, if you don’t provide an initial value when you declare an implicitly unwrapped optional variable or property, its value automatically defaults to nil.
ja: オプショナルと同様に、あなたが暗黙的にアンラップされるオプショナルの変数やプロパティに初期値を提供しないならば、その値は自動的に省略時のnilになります。

source: As with other examples of type safety in Swift, this approach avoids accidental errors and ensures that the intention of a particular section of code is always clear.
ja: スウィフトにおける型安全に関する他の例と同様に、このやり方は、偶然のエラーを避けること、そしてコードの特定の節の意図を常にはっきりさせることを確実にします。

source: As with other protocol member declarations, these property declarations declare only the getter and setter requirements for types that conform to the protocol.
ja: 他のプロトコルメンバー宣言と同様に、これらのプロパティ宣言はそのプロトコルに準拠する型のためのゲッターとセッター要件だけを宣言します。

source: As with prefix operators, postfix operator declarations don’t specify a precedence level.
ja: 接頭辞演算子と同様に、接尾辞演算子宣言は、優先順位レベルを指定しません。

source: As with read-only computed properties, you can simplify the declaration of a read-only subscript by removing the get keyword and its braces:
ja: 読み出し専用の計算プロパティでのように、あなたは読み出し専用の添え字の宣言を単純化することが、getキーワードとそれの波括弧を取り除くことによって行えます：

source: As with strong reference cycles between two class instances, you declare each captured reference to be a weak or unowned reference rather than a strong reference.
ja: ２つのクラスインスタンスの間の強い参照循環と同様に、あなたは各捕らえられた参照が強い参照というよりは弱いまたは非所有参照であると宣言します。

source: As with the closed range operator, the value of a must not be greater than b.
ja: 完結範囲演算子と同じように、aの値はbより大きくてはいけません。

source: As with the default initializer above, if you want a public structure type to be initializable with a memberwise initializer when used in another module, you must provide a public memberwise initializer yourself as part of the type’s definition.
ja: 上記の省略時のイニシャライザと同様に、あなたがある公開の構造体型を別のモジュール内で使うときにメンバー関連イニシャライザを使って初期化できるようにしたいならば、あなたは公開のメンバー関連イニシャライザをあなた自身でその型定義の一部として提供しなければなりません。

source: As with type property requirements, you always prefix type method requirements with the static keyword when they’re defined in a protocol.
ja: 型プロパティ要件と同様に、あなたは常に型メソッド要件の前に、それらがプロトコルにおいて定義されるとき、staticキーワードを置きます。

source: As you’ll see in Shorthand Getter Declaration, property getters can also use an implicit return.
ja: あなたが略記ゲッター宣言で見るように、プロパティゲッターもまた暗黙的なreturnを使用できます。

source: Assertions and Preconditions
ja: 表明と前提条件

source: Assertions help you find mistakes and incorrect assumptions during development, and preconditions help you detect issues in production.
ja: 表明は、あなたが失策や間違った想定を見つけるのを開発中に助けます、そして前提条件は、あなたが製品における問題点を見抜くのを助けます。

source: Assigning Constant Properties During Initialization
ja: 初期化の間に定数プロパティを割り当てる

source: Assigning to self Within a Mutating Method
ja: 変更メソッド内部でselfに代入する

source: Assignment Operator
ja: 代入演算子

source: Assignment is performed from each part of the value to the corresponding part of the expression.
ja: 代入は、値の各部分から式の対応する部分へと実行されます。

source: Associated Types
ja: 関連型

source: Associated Types in Action
ja: 関連型の動作

source: Associated Types with a Generic Where Clause
ja: 総称体where節を持つ関連型

source: Associated Values
ja: 関連値

source: Associated types are similar to type parameters in generic parameter clauses, but they’re associated with Self in the protocol in which they’re declared.
ja: 関連型は、総称体パラメータ節の中の型パラメータに似ています、しかしそれらは、それらが宣言されるプロトコルにおいてSelfと結び付けられます。

source: Associated types are specified with the associatedtype keyword.
ja: 関連型は、associatedtypeキーワードで指定されます。

source: Associated values are set when you create a new constant or variable based on one of the enumeration’s cases, and can be different each time you do so.
ja: 関連値は、あなたが列挙のケース節のうちの１つに基づいて新しい定数または変数を作るときに設定されます、そしてあなたがそうするたびに違ったものにすることが出来ます。

source: Assuming that you provide default values for any new properties you introduce in a subclass, the following two rules apply:
ja: あなたが省略時の値をあなたがサブクラスで導入するあらゆる新しいプロパティに用意すると仮定して、以下の２つの規則が適用されます：

source: At compile time, a key-path expression is replaced by an instance of the KeyPath [https://developer.apple.com/documentation/swift/keypath] class.
ja: コンパイル時に、キーパス式はKeyPath [https://developer.apple.com/documentation/swift/keypath]クラスのインスタンスによって置き換えられます。

source: At compile time, the key-path string expression is replaced by a string literal.
ja: コンパイル時で、キーパス文字列式は文字列リテラルによって置き換えられます。

source: At least one is a write access.
ja: 少なくとも１つが書き込みアクセスである。

source: At parse time, an expression made up of binary operators is represented as a flat list.
ja: 構文解析の時、二項演算子から成り立つ式は、平坦なリストとして表わされます。

source: At runtime, if the cast succeeds, the value of expression is wrapped in an optional and returned; otherwise, the value returned is nil.
ja: 実行時に、キャストが成功したならば、式の値がひとつのオプショナルの中にラップされて返されます；そうでなければ返される値はnilです。

source: At the end of resize(to:), the return statement checks $height and $width to determine whether the property wrapper adjusted either height or width.
ja: resize(to:)の終わりで、return文は$heightと$widthを確認して、プロパティラッパーがheightまたはwidthのどちらを調節したかを決定します。

source: At the end of the for-in loop, the values of movieCount and songCount contain a count of how many MediaItem instances were found of each type.
ja: for-inループの終わりに、movieCountとsongCountの値は、各型のMediaItemインスタンスがどれくらい見つけられたかの総数を含みます。

source: At the start of the game, the player is on “square zero”.
ja: ゲームの開始時点で、プレーヤーは−「正方形ゼロ」の上にいます。

source: At this point, the original Barcode.upc and its integer values are replaced by the new Barcode.qrCode and its string value.
ja: この点で、最初のBarcode.upcおよびその整数値は、新しいBarcode.qrCodeおよびその文字列値と取り替えられます。

source: Attempting to access an index outside of a string’s range or a Character at an index outside of a string’s range will trigger a runtime error.
ja: ある文字列の範囲外のインデックスにまたはある文字列の範囲外のインデックスでCharacterにアクセスを試みることは、実行時エラーの引き金となります。

source: Attempting to do so is reported as an error when your code is compiled:
ja: そうしようとすることは、あなたのコードがコンパイルされる時にエラーとして報告されます：

source: Attempting to do so results in a compile-time error.
ja: そうしようとすることは、それでコンパイル時エラーという結果となります。

source: Attributes
ja: 属性

source: Autoclosures
ja: 自動クロージャ

source: Automatic Initializer Inheritance
ja: 自動的なイニシャライザ継承

source: Automatic Reference Counting
ja: 自動参照カウント

source: Availability Condition
ja: 有効性条件

source: Avoid combining multiple instances of the ternary conditional operator into one compound statement.
ja: 三項条件演算子を使用したもの複数を１つの複合文に結合することを避けてください。

source: Avoiding default fallthrough means that Swift switch statements are much more concise and predictable than their counterparts in C, and thus they avoid executing multiple switch cases by mistake.
ja: 何もしなくても抜け落ちることを避けることは、スウィフトのswitch文がCでのそれに対応する物よりずっと簡潔で予測できること、そしてそれゆえに、それは誤って複数のswitchケース節を実行することを回避することを意味します。

source: Backslash (\\)
ja: バックスラッシュ（\\）

source: Based on the values of enteredDoorCode, passedRetinaScan, and hasDoorKey, the first two subexpressions are false.
ja: enteredDoorCode、passedRetinaScan、そしてhasDoorKeyの値に基づいて、最初の２つの下位の式はfalseです。

source: Basic Operators
ja: 基本の演算子

source: Be careful to ensure that operator interactions still behave in the way you intend when porting existing code to Swift.
ja: 既存のコードをスウィフトに移植するとき、依然としてあなたが意図するやり方で演算子相互作用が振る舞うことを確実にするように注意してください。

source: Be extended to expand their functionality beyond a default implementation
ja: それらの機能性を元の実装を越えて広げるために、拡張されます

source: Be warned, though—this function doesn’t compile, for reasons explained after the example:
ja: 注意するように、とは言うものの ― この関数はコンパイルしません、この例の後に説明される理由のために：

source: Because 1 is less than 2, (1, "zebra") is considered less than (2, "apple"), regardless of any other values in the tuples.
ja: 1は2より少ないことから、(1, "zebra")は(2, "apple")より少ないとみなされます、タプルの中のあらゆる他の値に関係なく。

source: Because BlackjackCard is a structure with no custom initializers, it has an implicit memberwise initializer, as described in Memberwise Initializers for Structure Types.
ja: BlackjackCardがあつらえのイニシャライザのない構造体であるので、構造型のためのメンバー関連イニシャライザで記述されるように、それは暗黙のメンバー関連イニシャライザを持ちます。

source: Because Int and Double, for example, both conform to the Comparable protocol, this function accepts arguments of either type.
ja: 例えば、IntとDoubleは両方ともComparableプロトコルに準拠するので、この関数はどちらの型の引数でも受け入れます。

source: Because capitalCity has a default nil value, a new Country instance is considered fully initialized as soon as the Country instance sets its name property within its initializer.
ja: capitalCityが省略時のnil値を持つので、新しいCountryインスタンスは、Countryインスタンスがそのイニシャライザ内でそのnameプロパティを設定するとすぐに、完全に初期化されると見なされます。

source: Because john.residence is nil, this optional chaining call fails in the same way as before.
ja: john.residenceがnilであるため、このオプショナル連鎖呼び出しは前と同じやり方で失敗します。

source: Because playerOne is an optional, it is qualified with an exclamation point (!) when its coinsInPurse property is accessed to print its default number of coins, and whenever its win(coins:) method is called:
ja: playerOneがオプショナルであることから、それは感嘆符（!）で修飾されます、それのもつcoinsInPurseプロパティがその省略時のコイン数を出力するためにアクセスされる時に、そして何時でもそれのwin(coins:)メソッドが呼ばれる時に：

source: Because rangeOfFourItems is declared as a constant (with the let keyword), it is not possible to change its firstValue property, even though firstValue is a variable property.
ja: rangeOfFourItemsが定数（letキーワードを使って）として宣言されるので、たとえfirstValueが変数プロパティであるとしても、そのfirstValueプロパティを変えることは可能ではありません。

source: Because T is a placeholder, Swift doesn’t look for an actual type called T.
ja: Tがプレースホルダであるので、スウィフトはTと呼ばれる実際の型を捜しません。

source: Because generator is known to adopt RandomNumberGenerator, it’s guaranteed to have a random() method to call.
ja: generatorがRandomNumberGeneratorを採用すると知られているので、それはrandom()メソッドを呼ぶことを保証されます。

source: Because userDefinedColorName is nil, the expression userDefinedColorName ?? defaultColorName returns the value of defaultColorName, or "red".
ja: userDefinedColorNameはnilなので、式userDefinedColorName ?? defaultColorNameは、defaultColorNameの値、すなわち"red"を返します。

source: Because Void is a type alias for (), you can use it to write an empty tuple type.
ja: Voidが()に対する型エイリアスであることから、あなたはそれを使って空のタプル型を書くことができます。

source: Because beginning is a substring of greeting, it reuses the memory that greeting uses.
ja: beginningがgreetingの下位文字列であることから、それはgreetingが使うメモリを再利用します。

source: Because makeASandwich() can throw an error, the function call is wrapped in a try expression.
ja: makeASandwich()はエラーをスロー可能なので、この関数呼び出しはtry式で包まれます。

source: Because Resolution is a structure, a copy of the existing instance is made, and this new copy is assigned to cinema.
ja: Resolutionが構造体であるので、既存のインスタンスのコピーが作成されます、そして、この新しいコピーはcinemaに代入されます。

source: Because item is a MediaItem instance, it’s possible that it might be a Movie; equally, it’s also possible that it might be a Song, or even just a base MediaItem.
ja: itemがMediaItemインスタンスであるので、それがMovieであるかもしれない可能性があります；等しく、それがSongかもしれない可能性もまたあります、または単に基盤MediaItemであることさえも。

source: Because AutomaticallyNamedDocument copes with the empty string case in a different way than its superclass, its initializer does not need to fail, and so it provides a nonfailable version of the initializer instead.
ja: AutomaticallyNamedDocumentが空の文字列の場合をそれのスーパークラスと異なるやり方でうまく処理するので、それのイニシャライザは失敗する必要はありません、それでそれはそうせずに、失敗できない改作のイニシャライザを提供します。

source: Because IntStack conforms to all of the requirements of the Container protocol, Swift can infer the appropriate Item to use, simply by looking at the type of the append(_:) method’s item parameter and the return type of the subscript.
ja: IntStackがContainerプロトコルの要件の全てに準拠するので、スウィフトは、単にappend(_:)メソッドのitemパラメータの型、そして、添え字の戻り型を見ることによって、使用するのに適切なitemを推論することができます。

source: Because Person conforms to both protocols, this call is valid, and the wishHappyBirthday(to:) function can print its birthday greeting.
ja: Personが両方のプロトコルに準拠するので、これは有効な呼び出しです、それでwishHappyBirthday(to:)関数はその誕生日のお祝いを出力できます。

source: Because game is known to conform to the DiceGame protocol, it’s guaranteed to have a dice property, and so the gameDidStart(_:) method is able to access and print the dice’s sides property, regardless of what kind of game is being played.
ja: gameがDiceGameプロトコルに従うと知られているので、それはdiceプロパティを持つと保証されます、なので、gameDidStart(_:)メソッドは、どんな種類のゲームがプレイされているかに関係なく、diceのsidesプロパティにアクセスして出力することができます。

source: Because john.residence is currently nil, the subscript call fails:
ja: john.residenceが現在nilなので、添え字呼び出しは失敗します：

source: Because userDefinedColorName is of an optional type, you can use the nil-coalescing operator to consider its value.
ja: userDefinedColorNameがオプショナル型であるため、あなたはその値を考慮するためにnil合体演算子を使うことが出来ます。

source: Because anotherPoint is always a tuple of two values, this case matches all possible remaining values, and a default case is not needed to make the switch statement exhaustive.
ja: anotherPointが常に２つの値のタプルであることから、このケース節は全てのあり得る残りの値にマッチします、そしてdefaultケース節はこのswitch文を網羅的にするのに必要ではありません。

source: Because Swift is type safe, it performs type checks when compiling your code and flags any mismatched types as errors.
ja: スウィフトが型安全であるので、それは、あなたのコードをコンパイルするとき型チェックを実行して、あらゆる組合せを誤った型をエラーとして合図します。

source: Because Swift manages memory automatically, most of the time you don’t have to think about accessing memory at all.
ja: スウィフトはメモリを自動的に管理することから、ほとんどの場合あなたはメモリアクセスについて考える必要は全くありません。

source: Because Swift’s switch statement is exhaustive and does not allow empty cases, it is sometimes necessary to deliberately match and ignore a case in order to make your intentions explicit.
ja: スウィフトのswitch文は網羅的でありそして中身が空のケース節を許さないので、あなたの意図を明確にするために故意にあるケース節にマッチしてから無視することが時々必要です。

source: Because a throw statement immediately transfers program control, an item will be vended only if all of these requirements are met.
ja: throw文が直ちにプログラム制御を移すので、これらの必要なものすべてが満たされる場合にのみ項目は販売されることになります。

source: Because a credit card will always have a customer, you define its customer property as an unowned reference, to avoid a strong reference cycle:
ja: クレジットカードが常にひとりの顧客を持つので、強い参照循環を避けるために、あなたはそのcustomerプロパティを非所有参照として定義します：

source: Because a failed assertion or precondition indicates an invalid program state, there’s no way to catch a failed assertion.
ja: 失敗した表明または前提条件は無効なプログラム状態を示すことから、失敗した表明を受け止めるための方法はありません。

source: Because a selector is created at compile time, not at runtime, the compiler can check that a method or property exists and that they’re exposed to the Objective-C runtime.
ja: あるセレクタが作成されるのはコンパイル時であり、実行時でないので、コンパイラはそのメソッドまたはプロパティが存在すること、そしてそれらがObjective-Cランタイムに露出されていることを確かめることができます。

source: Because a weak reference does not keep a strong hold on the instance it refers to, it’s possible for that instance to be deallocated while the weak reference is still referring to it.
ja: 弱い参照がそれが言及するインスタンスに対する強い支配力を保たないので、弱い参照がまだそれに言及している間にそのインスタンスが割り当て解除されることは可能です。

source: Because addition isn’t part of the essential behavior for a vector, the type method is defined in an extension of Vector2D rather than in the main structure declaration of Vector2D.
ja: 加算はベクトルの欠くことのできない挙動の部分ではないので、この型メソッドはVector2Dの拡張において定義されます、Vector2Dの主構造定義においてではなく。

source: Because all keys in the literal are of the same type as each other, and likewise all values are of the same type as each other, Swift can infer that [String: String] is the correct type to use for the airports dictionary.
ja: このリテラルの全てのキーが互いに同じ型である、そして全ての型が互いに他と同じ型であるので、スウィフトは、[String: String]がairports辞書に使うために適切な型であると推測することができます。

source: Because all of the types can be inferred, the return arrow (->) and the parentheses around the names of the parameters can also be omitted:
ja: 型の全てが推論されることができるので、戻り矢印（->）と、パラメータの名前のまわりの丸括弧もまた省略することができます：

source: Because all properties of the ShoppingListItem class have default values, and because it is a base class with no superclass, ShoppingListItem automatically gains a default initializer implementation that creates a new instance with all of its properties set to their default values.
ja: ShoppingListItemクラスの全てのプロパティ省略時の値を持つことから、そしてそれがスーパークラスを持たない基盤クラスであることから、ShoppingListItemは自動的に省略時のイニシャライザ実装を獲得します、それは、それのプロパティの全てをそれらの省略時の値に設定して、新しいインスタンスを作成します。

source: Because all values in the array literal are of the same type, Swift can infer that Set<String> is the correct type to use for the favoriteGenres variable.
ja: 配列リテラルの中の全ての値が同じ型であることから、スウィフトはSet<String>が正しい型であると推論することができ、favoriteGenres変数に使用します。

source: Because all values in the array literal are of the same type, Swift can infer that [String] is the correct type to use for the shoppingList variable.
ja: この配列リテラルの値の全てが同じ型であるので、スウィフトは[String]がshoppingList変数のために利用されるのに正しい型であると推測することができます。

source: Because an addition operator was defined earlier, you don’t need to reimplement the addition process here.
ja: 加算演算子は以前に定義されたので、あなたはここでは加算プロセスを再実装する必要はありません。
